{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "kernel_regularizer": null, "batch_input_shape": [null, 10000], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "units": 256, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "bias_constraint": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "units": 2, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_3", "bias_constraint": null, "trainable": true, "kernel_constraint": null}}], "name": "sequential_1"}}